Revit 2024 API
GroupTypeId.EnergyAnalysisBuildingData Property
 Building Data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId EnergyAnalysisBuildingData { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisBuildingData As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisBuildingData {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace